IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G1_EPWM11_CONTROLSS_G1_EPWM11.xml
	<register id="CONTROLSS_G1_EPWM11_HRCNFG" acronym="CONTROLSS_G1_EPWM11_HRCNFG" offset="0x40" width="16" description="HRPWM Configuration Register [[br]] [[br]]This register is only accessible on EPWM modules with HRPWM capabilities.">
		<bitfield id="LINESEL" width="2" begin="15" end="14" resetval="0x0" description="Delay Line Selection Bits: Selects which of the 4 delay lines for a particular ePWM/EPWM module to send to CALIN for calibration." range="15 - 14" rwaccess="R/W"/> 
		<bitfield id="HRLOADB" width="2" begin="12" end="11" resetval="0x0" description="Shadow Mode Bit  Selects the time event that loads the CMPBHR shadow value into the active register.   00: Load on CTR = Zero: Time-base counter equal to zero [TBCTR = 0x0000]  01: Load on CTR = PRD: Time-base counter equal to period [TBCTR = TBPRD]  10: Load on either CTR = Zero or CTR = PRD  11: Load on CMPB_EQ [Translator Event CMPB-3]  " range="12 - 11" rwaccess="R/W"/> 
		<bitfield id="CTLMODEB" width="1" begin="10" end="10" resetval="0x0" description="Control Mode Bits  Selects the register [CMP/TBPRD or TBPHS] that controls the MEP:   0: CMPBHR[8] or TBPRDHR[8] Register controls the edge position [i.e., this is duty or period control mode]. [Default on Reset]  1: TBPHSHR[8] Register controls the edge position [i.e., this is phase control mode]." range="10" rwaccess="R/W"/> 
		<bitfield id="EDGMODEB" width="2" begin="9" end="8" resetval="0x0" description="Edge Mode Bits  Selects the edge of the PWM that is controlled by the micro-edge position [MEP] logic:   00: HRPWM capability is disabled [default on reset]  01: MEP control of rising edge [CMPBHR]  10: MEP control of falling edge [CMPBHR]  11: MEP control of both edges [TBPHSHR or TBPRDHR]" range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="SWAPAB" width="1" begin="7" end="7" resetval="0x0" description="Swap ePWM A &#38; B Output Signals  This bit enables the swapping of the A &#38; B signal outputs. The selection is as follows:   0: ePWMxA and ePWMxB outputs are unchanged.  1: ePWMxA signal appears on ePWMxB output and ePWMxB signal appears on ePWMxA output." range="7" rwaccess="R/W"/> 
		<bitfield id="AUTOCONV" width="1" begin="6" end="6" resetval="0x0" description="Auto Convert Delay Line Value  Selects whether the fractional duty cycle/period/phase in the CMPAHR/TBPRDHR/TBPHSHR register is automatically scaled by the MEP scale factor in the HRMSTEP register or manually scaled by calculations in application software. The SFO library function automatically updates the HRMSTEP register with the appropriate MEP scale factor.   0: Automatic HRMSTEP scaling is disabled.  1: Automatic HRMSTEP scaling is enabled.  If application software is manually scaling the fractional duty cycle, or phase [i.e. software sets CMPAHR = [fraction[PWMduty * PWMperiod] * MEP Scale Factor]&#38;#60;&#38;#60;8 + 0x080 for duty cycle], then this mode must be disabled." range="6" rwaccess="R/W"/> 
		<bitfield id="SELOUTB" width="1" begin="5" end="5" resetval="0x0" description="EPWMxB Output Select Bit  This bit selects which signal is output on the ePWMxB channel output. The inversion will take the high resolution mode into account and the inverted signal will contain any high resolution modification. The inversion takes place as the last step in modifying the ePWMxB signal.   0: ePWMxB output is normal.  1: ePWMxB output is inverted version of ePWMxA signal." range="5" rwaccess="R/W"/> 
		<bitfield id="HRLOAD" width="2" begin="4" end="3" resetval="0x0" description="Shadow Mode Bit  Selects the time event that loads the CMPAHR shadow value into the active register.   00: Load on CTR = Zero: Time-base counter equal to zero [TBCTR = 0x0000]  01: Load on CTR = PRD: Time-base counter equal to period [TBCTR = TBPRD]  10: Load on either CTR = Zero or CTR = PRD  11: Load on CMPA_EQ [Translator Event CMPA-3]  " range="4 - 3" rwaccess="R/W"/> 
		<bitfield id="CTLMODE" width="1" begin="2" end="2" resetval="0x0" description="Control Mode Bits  Selects the register [CMP/TBPRD or TBPHS] that controls the MEP:   0: CMPAHR[8] or TBPRDHR[8] Register controls the edge position [i.e., this is duty or period control mode]. [Default on Reset]  1: TBPHSHR[8] Register controls the edge position [i.e., this is phase control mode]." range="2" rwaccess="R/W"/> 
		<bitfield id="EDGMODE" width="2" begin="1" end="0" resetval="0x0" description="Edge Mode Bits  Selects the edge of the PWM that is controlled by the micro-edge position [MEP] logic:   00: HRPWM capability is disabled [default on reset]  01: MEP control of rising edge [CMPAHR]  10: MEP control of falling edge [CMPAHR]  11: MEP control of both edges [TBPHSHR or TBPRDHR]" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM11_HRCNFG2" acronym="CONTROLSS_G1_EPWM11_HRCNFG2" offset="0x4E" width="16" description="HRPWM Configuration 2 Register [[br]] [[br]]This register is only accessible on EPWM modules with HRPWM capabilities. Only 16 bit accesses are allowed for this register.  Debugger access in 32 bit mode may display incorrect values.">
		<bitfield id="NOBYPASS" width="1" begin="15" end="15" resetval="0x0" description="No Bypass Delay Line Update Bit: For internal test purposes, this bit disables the 1 SYSCLK cycle bypass before delay line is updated." range="15" rwaccess="R/W"/> 
		<bitfield id="DELLOADFRC" width="1" begin="14" end="14" resetval="0x0" description="Delay Line Load Software Force: For internal test purposes, software force generates a pulse which forces a delay line update [similar to PRD_eq/CNT_zero strobe]." range="14" rwaccess="R/W1TS"/> 
		<bitfield id="CTLMODEDBFED" width="2" begin="5" end="4" resetval="0x0" description="Shadow Mode Bit - selection should match DBCTL[LOADFEDMODE]  Selects the time event that loads the DBFEDHR shadow value into the active register.   00 Load on CTR = Zero: Time-base counter equal to zero [TBCTR = 0x0000]  01 Load on CTR = PRD: Time-base counter equal to period [TBCTR = TBPRD]  10 Load on either CTR = Zero or CTR = PRD  11 Reserved" range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="CTLMODEDBRED" width="2" begin="3" end="2" resetval="0x0" description="Shadow Mode Bit - selection should match DBCTL[LOADREDMODE]  Selects the time event that loads the DBREDHR shadow value into the active register.   00 Load on CTR = Zero: Time-base counter equal to zero [TBCTR = 0x0000]  01 Load on CTR = PRD: Time-base counter equal to period [TBCTR = TBPRD]  10 Load on either CTR = Zero or CTR = PRD  11 Reserved" range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="EDGMODEDB" width="2" begin="1" end="0" resetval="0x0" description="Edge Mode Bits  Selects the edge of the PWM that is controlled by the micro-edge position [MEP] logic:   00 HRPWM capability is disabled [default on reset]  01 MEP control of rising edge [DBREDHR]  10 MEP control of falling edge [DBFEDHR]  11 MEP control of both edges [rising edge of DBREDHR or falling edge of DBFEDHR ]" range="1 - 0" rwaccess="R/W"/>
	</register>
