IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G1_EPWM11_CONTROLSS_G1_EPWM11.xml
	<register id="CONTROLSS_G1_EPWM11_DESTS" acronym="CONTROLSS_G1_EPWM11_DESTS" offset="0x80C" width="32" description="DE Status register">
		<bitfield id="DEACTIVE" width="1" begin="0" end="0" resetval="0x0" description="0 : Diode emulation mode is not active 1 : Diode emulation mode is active" range="0" rwaccess="R"/>
	</register>
	<register id="CONTROLSS_G1_EPWM11_DEFRC" acronym="CONTROLSS_G1_EPWM11_DEFRC" offset="0x810" width="32" description="DE Status force register">
		<bitfield id="DEACTIVE" width="1" begin="0" end="0" resetval="0x0" description="0 : No effect. 1 : Forces DEACTIVE flag to 1." range="0" rwaccess="R/W1TS"/>
	</register>
	<register id="CONTROLSS_G1_EPWM11_DECLR" acronym="CONTROLSS_G1_EPWM11_DECLR" offset="0x814" width="32" description="DE Status clear register">
		<bitfield id="DEACTIVE" width="1" begin="0" end="0" resetval="0x0" description="0 : No effect. 1 : Clears DEACTIVE flag." range="0" rwaccess="R/W1TS"/>
	</register>
	<register id="CONTROLSS_G1_EPWM11_DEMONCNT" acronym="CONTROLSS_G1_EPWM11_DEMONCNT" offset="0x820" width="32" description="DE trip monitor counter">
		<bitfield id="CNT" width="16" begin="15" end="0" resetval="0x0" description="An 16-bit counter which monitors the frequency of diode mode trip events. When TripHorTripL is active:    Increment CNT [increment INCSTEP on every EPWMxSYNC] When TripHorTripL is in-active: Decrement CNT [decrement DECSTEP on every EPWMxSYNC] If[ CNT > THRESHOLD] then generate DETRIP and clear the counter. If[ [CNT - DECSTEP] &#38;#60; 0] then CNT = 0 If[ [CNT + INCSTEP] >= 0xFFFF] then CNT = 0xFFFF  Note : CNT is cleared when DECTL.ENABLE is 0 Note: DEMONTHRES == 0x0 should not generate trip as the DEMONTHRES and DEMONCNT registers have reset value of 0x0" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="CONTROLSS_G1_EPWM11_DEMONCTL" acronym="CONTROLSS_G1_EPWM11_DEMONCTL" offset="0x824" width="32" description="DE monitor mode control">
		<bitfield id="ENABLE" width="1" begin="0" end="0" resetval="0x0" description="Enable bit for DE Mode Monitor counter function. 0: DE Mode Monitor counter function is disabled 1: DE Mode Monitor counter function is enabled" range="0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM11_DEMONSTEP" acronym="CONTROLSS_G1_EPWM11_DEMONSTEP" offset="0x828" width="32" description="DE monitor counter step">
		<bitfield id="DECSTEP" width="8" begin="23" end="16" resetval="0x0" description="Defines the decrement step of DEMONCNT.CNT counter." range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="INCSTEP" width="8" begin="7" end="0" resetval="0x0" description="Defines the increment step of DEMONCNT.CNT counter." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM11_DEMONTHRES" acronym="CONTROLSS_G1_EPWM11_DEMONTHRES" offset="0x82C" width="32" description="DE monitor counter threshold">
		<bitfield id="THRESHOLD" width="16" begin="15" end="0" resetval="0x0" description="Defines the threshold of DE monitor counter. " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM11_MINDBCFG" acronym="CONTROLSS_G1_EPWM11_MINDBCFG" offset="0xC00" width="32" description="Minimum dead band configuration register.">
		<bitfield id="POLSELB" width="1" begin="24" end="24" resetval="0x0" description="Select signal for the AND OR logic of BLOCKB [output of SELBLOCKB mux] and PWMB signals 0 : Select BLOCKB is inverted and ANDed with PWMB. 1 : Select BLOCKB is Ored with PWMB." range="24" rwaccess="R/W"/> 
		<bitfield id="SELB" width="4" begin="23" end="20" resetval="0x0" description="PWMB min dead band reference 0x0 : DEPWMB  0x1 : Output 1 from PWM output XBAR 0x2 : Output 2 from PWM output XBAR . . 0xf : Output 15 from PWM output XBAR" range="23 - 20" rwaccess="R/W"/> 
		<bitfield id="SELBLOCKB" width="1" begin="19" end="19" resetval="0x0" description="0 : Select BLOCKB as the blocking signal on PWMB. 1 : Select BLOCKA as the blocking signal on PWMB." range="19" rwaccess="R/W"/> 
		<bitfield id="INVERTB" width="1" begin="18" end="18" resetval="0x0" description="0 : No inversion on the selected reference signal which is used in the min deadband logic on PWMB. 1 : Invert the selected reference signal which is used in the min deadband logic on PWMB." range="18" rwaccess="R/W"/> 
		<bitfield id="ENABLEB" width="1" begin="16" end="16" resetval="0x0" description="0 : Minimum dead band logic is disabled 1 : Minimum dead band logic is enabled " range="16" rwaccess="R/W"/> 
		<bitfield id="POLSELA" width="1" begin="8" end="8" resetval="0x0" description="Select signal for the AND OR logic of BLOCKA [output of SELBLOCKA mux] and PWMA signals 0 : Select BLOCKA is inverted and ANDed with PWMA. 1 : Select BLOCKA is Ored with PWMA." range="8" rwaccess="R/W"/> 
		<bitfield id="SELA" width="4" begin="7" end="4" resetval="0x0" description="PWMA min dead band reference 0x0 : DEPWMA  0x1 : Output 1 from PWM output XBAR 0x2 : Output 2 from PWM output XBAR . . 0xf : Output 15 from PWM output XBAR" range="7 - 4" rwaccess="R/W"/> 
		<bitfield id="SELBLOCKA" width="1" begin="3" end="3" resetval="0x0" description="0 : Select BLOCKA as the blocking signal on PWMA. 1 : Select BLOCKB as the blocking signal on PWMB." range="3" rwaccess="R/W"/> 
		<bitfield id="INVERTA" width="1" begin="2" end="2" resetval="0x0" description="0 : No inversion on the selected reference signal which is used in the min deadband logic on PWMA. 1 : Invert the selected reference signal which is used in the min deadband logic on PWMA." range="2" rwaccess="R/W"/> 
		<bitfield id="ENABLEA" width="1" begin="0" end="0" resetval="0x0" description="0 : Minimum dead band logic is disabled 1 : Minimum dead band logic is enabled " range="0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM11_MINDBDLY" acronym="CONTROLSS_G1_EPWM11_MINDBDLY" offset="0xC04" width="32" description="Minimum dead band delay register">
		<bitfield id="DELAYB" width="16" begin="31" end="16" resetval="0x0" description="Minimum dead band delay on PWMB in terms of SYSCLK cycles.  For delay value of 0, user should configure MINDBCFG[ENABLEA/B] = '0'.  If MINDBCFG[ENABLEA/B] = '1' and  MINDBDLY[DELAYA/B]='0' then delay is '1' cycle is applied." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="DELAYA" width="16" begin="15" end="0" resetval="0x0" description="Minimum dead band delay on PWMA in terms of SYSCLK cycles.  For delay value of 0, user should configure MINDBCFG[ENABLEA/B] = '0'.  If MINDBCFG[ENABLEA/B] = '1' and  MINDBDLY[DELAYA/B]='0' then delay is '1' cycle is applied." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM11_LUTCTLA" acronym="CONTROLSS_G1_EPWM11_LUTCTLA" offset="0xC20" width="32" description="LUT control register on PWMA">
		<bitfield id="LUTDEC7" width="1" begin="23" end="23" resetval="0x0" description="0 : Force 0 1 : Force 1" range="23" rwaccess="R/W"/> 
		<bitfield id="LUTDEC6" width="1" begin="22" end="22" resetval="0x0" description="0 : Force 0 1 : Force 1" range="22" rwaccess="R/W"/> 
		<bitfield id="LUTDEC5" width="1" begin="21" end="21" resetval="0x0" description="0 : Force 0 1 : Force 1" range="21" rwaccess="R/W"/> 
		<bitfield id="LUTDEC4" width="1" begin="20" end="20" resetval="0x0" description="0 : Force 0 1 : Force 1" range="20" rwaccess="R/W"/> 
		<bitfield id="LUTDEC3" width="1" begin="19" end="19" resetval="0x0" description="0 : Force 0 1 : Force 1" range="19" rwaccess="R/W"/> 
		<bitfield id="LUTDEC2" width="1" begin="18" end="18" resetval="0x0" description="0 : Force 0 1 : Force 1" range="18" rwaccess="R/W"/> 
		<bitfield id="LUTDEC1" width="1" begin="17" end="17" resetval="0x0" description="0 : Force 0 1 : Force 1" range="17" rwaccess="R/W"/> 
		<bitfield id="LUTDEC0" width="1" begin="16" end="16" resetval="0x0" description="0 : Force 0 1 : Force 1" range="16" rwaccess="R/W"/> 
		<bitfield id="SELXBAR" width="4" begin="7" end="4" resetval="0x0" description="Selects one of the 16 outputs of ICSSXBAR to feed into IN3 of LUTA" range="7 - 4" rwaccess="R/W"/> 
		<bitfield id="BYPASS" width="1" begin="0" end="0" resetval="0x1" description="1 : Bypass LUT logic on PWMA 0 : PWMA driven by LUTA" range="0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM11_LUTCTLB" acronym="CONTROLSS_G1_EPWM11_LUTCTLB" offset="0xC24" width="32" description="LUT control register on PWMB">
		<bitfield id="LUTDEC7" width="1" begin="23" end="23" resetval="0x0" description="0 : Force 0 1 : Force 1" range="23" rwaccess="R/W"/> 
		<bitfield id="LUTDEC6" width="1" begin="22" end="22" resetval="0x0" description="0 : Force 0 1 : Force 1" range="22" rwaccess="R/W"/> 
		<bitfield id="LUTDEC5" width="1" begin="21" end="21" resetval="0x0" description="0 : Force 0 1 : Force 1" range="21" rwaccess="R/W"/> 
		<bitfield id="LUTDEC4" width="1" begin="20" end="20" resetval="0x0" description="0 : Force 0 1 : Force 1" range="20" rwaccess="R/W"/> 
		<bitfield id="LUTDEC3" width="1" begin="19" end="19" resetval="0x0" description="0 : Force 0 1 : Force 1" range="19" rwaccess="R/W"/> 
		<bitfield id="LUTDEC2" width="1" begin="18" end="18" resetval="0x0" description="0 : Force 0 1 : Force 1" range="18" rwaccess="R/W"/> 
		<bitfield id="LUTDEC1" width="1" begin="17" end="17" resetval="0x0" description="0 : Force 0 1 : Force 1" range="17" rwaccess="R/W"/> 
		<bitfield id="LUTDEC0" width="1" begin="16" end="16" resetval="0x0" description="0 : Force 0 1 : Force 1" range="16" rwaccess="R/W"/> 
		<bitfield id="SELXBAR" width="4" begin="7" end="4" resetval="0x0" description="Selects one of the 16 outputs of ICSSXBAR to feed into IN3 of LUTB" range="7 - 4" rwaccess="R/W"/> 
		<bitfield id="BYPASS" width="1" begin="0" end="0" resetval="0x1" description="1 : Bypass LUT logic on PWMB 0 : PWMB driven by LUTB" range="0" rwaccess="R/W"/>
	</register>
</module>